Tutorials-3.0.1/compressible/backwardStep/Transient/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div((-devRhoReff&U))	  Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    
    //momentum equation
    div(phi_nei,U)	Gauss vanLeerV;
    div(phi_own,U)	Gauss vanLeerV;

    //energy equation
    div(phi_nei,h)	Gauss vanLeer;
    div(phi_own,h)	Gauss vanLeer;
    div(phi_nei,Ek)	Gauss vanLeer;
    div(phi_own,Ek)	Gauss vanLeer;

    //continuity equation
    div(phid_nei,p)	Gauss vanLeer;
    div(phid_own,p)	Gauss vanLeer;
    
    div(phi,omega)   Gauss vanLeer;
    div(phi,k)	       Gauss vanLeer;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         none;
    
    interpolate(rho)		linear;
    interpolate((rho*U))	linear;
    
    reconstruct(psi)		vanLeer;
    reconstruct(p)		vanLeer;
    reconstruct(U)		vanLeerV;
    reconstruct(Dp)		vanLeer;
    
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    p;
}

wallDist
{
    method	meshWave;
}
// ************************************************************************* //
